---
kind: method
id: M:Autodesk.Revit.DB.NurbsSurfaceData.GetKnotsV
source: html/1b0fea7f-4fd0-bee4-cc1b-773b13b2e36b.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.GetKnotsV Method

Get the list of knots in the v-direction.

## Syntax (C#)
```csharp
public IList<double> GetKnotsV()
```